[
  {
    "id": 1,
    "authors": "Денис Полторак",
    "name": "Архитектурные меташаблоны",
    "isbn": "",
    "description": "Архитектурные меташаблоны помогают разобраться в сложностях, окружающих архитектуру программного обеспечения, описывая некоторые общие (и не очень) шаблоны, которые архитектор может использовать для лучшего понимания и формирования архитектурных решений.",
    "image": "img/metapatterns.png",
    "link": "https://leanpub.com/metapatterns"
  },
  {
    "id": 3,
    "authors": "Мартин Фаулер",
    "name": "Рефакторинг",
    "isbn": "978-5-8459-2118-4",
    "description": "Рефакторинг — это процесс изменения программной системы, не затрагивающий её функциональности и имеющий целью облегчение понимания её работы и упрощение внесения изменений.",
    "image": "img/refactoring.png",
    "link": "https://www.flip.kz/catalog?prod=1110120"
  },
  {
    "id": 4,
    "authors": "Эрик Эванс",
    "name": "Предметно-ориентированное проектирование",
    "isbn": "978-5-8459-1910-5",
    "description": "Создание программного обеспечения, которое отвечает сложным потребностям, само по себе сложная задача, требующая как высоких технических навыков, так и глубокого понимания предметной области.",
    "image": "img/ddd.png",
    "link": "https://www.flip.kz/catalog?prod=855174"
  },
  {
    "id": 6,
    "authors": "Стив Макконнелл",
    "name": "Совершенный код",
    "isbn": "978-5-7502-0064-2",
    "description": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий.",
    "image": "img/code-complete.png",
    "link": "https://www.flip.kz/catalog?prod=89644"
  },
  {
    "id": 8,
    "authors": "Джошуа Блох",
    "name": "Effective Java",
    "isbn": "978-0-13-468599-1",
    "description": "Автор этой книги, Джошуа Блох, был ведущим разработчиком платформы Java в компании Sun Microsystems и является автором многих возможностей этого языка и платформы.",
    "image": "img/effective-java.png",
    "link": "https://www.flip.kz/catalog?prod=1302343"
  },
  {
    "id": 9,
    "authors": "Брукс Фредерик",
    "name": "Мифический человеко-месяц, или как создаются программные системы",
    "isbn": "978-5-4461-1636-2",
    "description": "Немногие книги по управлению проектами можно назвать столь же значимыми как «Мифический человеко-месяц». Смешение примеров из реальной разработки ПО, мнений и размышлений создает яркую картину управления сложными проектами. Эти эссе основаны на пятидесятилетнем опыте работы Брукса менеджером проектов в IBM System/360, а затем в OS/360. Первое издание книги вышло 45 лет назад, второе 25 лет назад. Возникают новые методологии, появляются новые языки программирования, растет количество процессоров, но эта книга продолжает оставаться актуальной. Почему? Спустя полвека мы продолжаем повторять ошибки, которые описал Брукс. Некоторые темы, поднимаемые в книге, кажутся устаревшими, но это лишь видимость. Фундаментальные проблемы, стоящие за ними, все так же актуальны в наше время. Важно знать свое прошлое, чтобы понимать, куда развивается индустрия разработки программного обеспечения. Поэтому, спустя 45 лет мы и читаем БруксаМногое изменилось в мире, но девять женщин всё так же не могут выносить ребенка за один месяц.",
    "image": "img/uml-patterns.png",
    "link": "https://www.flip.kz/catalog?prod=1787881"
  }
]